#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["dead","babyoushka","papaus","mamu"]


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    ["dead",300],
    ["babyoushka",200],
    ["papaus",101],
    ["mamu",100],
]

# Выведите на консоль рост отца в формате
print("Рост отца -",101)

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
print("общий рост -",701)
